cf_billing/Documents/энргРегистрацияПросуженнойПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРегистрацияПросуженнойПени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПросуженнаяПени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРанееНачисленнойПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просуженная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргПросуженнаяПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПросуженнаяПени</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просуженная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРанееНачисленнойПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргРучноеИзменениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРучноеИзменениеПени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргОплатаПени</xr:Item>
				<xr:Item>AccumulationRegister.энргНачислениеПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПросуженнойПени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРанееНачисленнойПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргРегистрацияПросуженнойПени/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	Пакет = ПолучитьДанныеТЧ();	
	ДанныеДанныеЗадолженности = Пакет[0]; 
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеДанныеЗадолженности,	Движения.энргПросуженнаяПени);
	
	СоздатьДокументРучноеИзменениеПени(Ссылка);
КонецПроцедуры  

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого СтрокаТЧ Из ПросуженнаяЗадолженность Цикл
		Если СтрокаТЧ.Просуженная Тогда
			Если СтрокаТЧ.Сумма <= 0 Тогда
				Отказ = истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не правильно заполнено поле ""Сумма""", ЭтотОбъект,"ПросуженнаяЗадолженность["+(СтрокаТЧ.НомерСтроки-1)+"].Сумма");				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРучноеИзменениеПени.Ссылка КАК Ссылка,
		|	энргРучноеИзменениеПени.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
		|ГДЕ
		|	энргРучноеИзменениеПени.ДокументОснование = &мДокументы
		|";
	
	Запрос.УстановитьПараметр("мДокументы", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл 
		РучноеИзменениеПениОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Истина);
		РучноеИзменениеПениОбъект.Пени.Очистить();
		РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТЧ()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы", Ссылка);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Шапка.Дата КАК Период,
		|	Шапка.Ссылка КАК Регистратор,
		|	Шапка.Организация КАК Организация,
		|	Шапка.Район КАК Район,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	Шапка.Абонент КАК Абонент,
		|	ТаблицаЗадолженности.Услуга КАК Услуга,
		|	ТаблицаЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаЗадолженности.ПериодРасчета КАК ПериодРасчета,
		|	ТаблицаЗадолженности.Поставщик КАК Поставщик,
		|	ТаблицаЗадолженности.Сумма КАК Сумма,
		|	ТаблицаЗадолженности.Просуженная КАК Просуженная, 
		|	ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени
		|ИЗ
		|	Документ.энргРегистрацияПросуженнойПени КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПросуженнойПени.ПросуженнаяЗадолженность КАК ТаблицаЗадолженности
		|		ПО Шапка.Ссылка = ТаблицаЗадолженности.Ссылка
		|			И (Шапка.Ссылка В (&мДокументы))
		|			И (ТаблицаЗадолженности.Ссылка В (&мДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	ТаблицаЗадолженности.Просуженная = ИСТИНА";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();   	
КонецФункции 

Процедура СоздатьДокументРучноеИзменениеПени(Ссылка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРучноеИзменениеПени.Ссылка КАК Ссылка,
		|	энргРучноеИзменениеПени.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_Перерасчет
		|ИЗ
		|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
		|ГДЕ
		|	энргРучноеИзменениеПени.ДокументОснование = &мДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.Район КАК Район,
		|	Шапка.Абонент КАК Абонент,
		|	Шапка.Дата КАК Дата,
		|	Шапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	Шапка.КлючПомещения КАК КлючПомещения,
		|	ЛОЖЬ КАК НеУчитывать,
		|	Шапка.Ответственный КАК Ответственный,
		|	Шапка.Примечание КАК Примечание,
		|	Шапка.Ссылка КАК ДокументОснование,
		|	ТаблицаЗадолженности.Услуга КАК Услуга,
		|	ТаблицаЗадолженности.Поставщик КАК Поставщик,
		|	ТаблицаЗадолженности.ПериодРасчета КАК ПериодРасчета,
		|	ТаблицаЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаЗадолженности.Сумма - ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК Сумма,
		|	ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.энргРегистрацияПросуженнойПени КАК Шапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПросуженнойПени.ПросуженнаяЗадолженность КАК ТаблицаЗадолженности
		|		ПО Шапка.Ссылка = ТаблицаЗадолженности.Ссылка
		|			И (Шапка.Ссылка В (&мДокументы))
		|			И (ТаблицаЗадолженности.Ссылка В (&мДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	ТаблицаЗадолженности.Просуженная
		|	И (ТаблицаЗадолженности.СуммаРанееНачисленнойПени > ТаблицаЗадолженности.Сумма
		|			ИЛИ ТаблицаЗадолженности.СуммаРанееНачисленнойПени < ТаблицаЗадолженности.Сумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Район КАК Район,
		|	ВТ_ДанныеДокумента.Абонент КАК Абонент,
		|	ВТ_ДанныеДокумента.Дата КАК Дата,
		|	ВТ_ДанныеДокумента.Организация КАК Организация,
		|	ВТ_ДанныеДокумента.МКД КАК МКД,
		|	ВТ_ДанныеДокумента.КлючПомещения КАК КлючПомещения,
		|	ВТ_ДанныеДокумента.НеУчитывать КАК НеУчитывать,
		|	ВТ_ДанныеДокумента.Ответственный КАК Ответственный,
		|	ВТ_ДанныеДокумента.Примечание КАК Примечание,
		|	ВТ_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
		|	ВТ_ДанныеДокумента.Услуга КАК Услуга,
		|	ВТ_ДанныеДокумента.Поставщик КАК Поставщик,
		|	ВТ_ДанныеДокумента.ПериодРасчета КАК ПериодРасчета,
		|	ВТ_ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ДанныеДокумента.Сумма КАК Сумма,
		|	ВТ_ДанныеДокумента.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени,
		|	ВТ_Перерасчет.Ссылка КАК РучноеИзменениеПени
		|ИЗ
		|	ВТ_Перерасчет КАК ВТ_Перерасчет
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПО ВТ_Перерасчет.ДокументОснование = ВТ_ДанныеДокумента.ДокументОснование
		|ИТОГИ
		|	МАКСИМУМ(Район),
		|	МАКСИМУМ(Абонент),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(МКД),
		|	МАКСИМУМ(КлючПомещения),
		|	МАКСИМУМ(НеУчитывать),
		|	МАКСИМУМ(Ответственный),
		|	МАКСИМУМ(Примечание)
		|ПО
		|	ДокументОснование,
		|	РучноеИзменениеПени";
	
	Запрос.УстановитьПараметр("мДокументы", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаДокументОснование = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НеПервыйДокумент = Ложь;
	
	Пока ВыборкаДокументОснование.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДокументОснование.ДокументОснование) Тогда 
			НеПервыйДокумент = Истина;
		КонецЕсли;
		
		ВыборкаИзмененияПени = ВыборкаДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		Пока ВыборкаИзмененияПени.Следующий() Цикл
			Если НеПервыйДокумент Тогда 
				Если ЗначениеЗаполнено(ВыборкаИзмененияПени.РучноеИзменениеПени) Тогда
					РучноеИзменениеПениОбъект = ВыборкаИзмененияПени.РучноеИзменениеПени.ПолучитьОбъект();
					РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Истина);
					РучноеИзменениеПениОбъект.Пени.Очистить();
					РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаИзмененияПени.РучноеИзменениеПени) Тогда
				РучноеИзменениеПениОбъект = ВыборкаИзмененияПени.РучноеИзменениеПени.ПолучитьОбъект();
				РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Ложь);
				РучноеИзменениеПениОбъект.Пени.Очистить();     
			Иначе
				РучноеИзменениеПениОбъект = Документы.энргРучноеИзменениеПени.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(РучноеИзменениеПениОбъект, ВыборкаИзмененияПени);
			РучноеИзменениеПениОбъект.ПериодНачисления	= ПериодНачисления;
			
			ВыборкаДетальныеЗаписи = ВыборкаИзмененияПени.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НовСтр = РучноеИзменениеПениОбъект.Пени.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			КонецЦикла; 
			РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчетаПени", РучноеИзменениеПениОбъект.Ссылка);
			НеПервыйДокумент = Истина;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
